Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྲུལ་པའི་ཚོགས་ཀྱི་གཟུགས་བརྙན་མང་པོའི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྦྱོར་བའི་གཟུགས་བརྙན་མང་པོའི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་བྱུང་བའི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་གཟུགས་བརྙན་རབ་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་དང་། བྱང་ཆུབ་ཀྱི་ཤིང་གི་གཟུགས་ཀྱི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་གཟུགས་བརྙན་མང་པོའི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་བྱུང་བའི་འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བས། སྐད་ཅིག་སྐད་ཅིག་ཏུ་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཤིང་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས།
en: In the northwestern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Vairocana­śrī­praṇidhi­garbhā, the Tathāgata Samanta­vairocana­śrī­meru­rāja’s buddha realm, where the bodhisattva Vairocana­praṇidhi­jñāna­ketu, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the bodies of all the tathāgatas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the bodies of all the bodhisattvas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the bodies of all the assemblies of followers of all the tathāgatas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the bodies of all the hosts of emanations of all the tathāgatas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of all the past practices of all the tathāgatas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the bodies of all śrāvakas and pratyeka­buddhas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the forms of all the bodhimaṇḍas and Bodhi trees of all the tathāgatas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of the many images of the miracles of all the tathāgatas who appear in the three times; emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the bodies of all world-lords who appear in the three times; and emanated, from all his signs and features of a great being, all his pores, and his entire body, clouds of images of the pure realms of the buddhas who have appeared in the three times.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ། འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། ནུབ་དང་བྱང་གི་ཕྱོགས་མཚམས་སུ་བརྟེན་ཏེ། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཕྱོགས་ཀུན་ནས་རྣམ་པར་སྣང་བའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེ་འགྲོ་བ་རྣམ་པར་སྣང་བའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས་མུ་ཏིག་འོད་ཐུབ་པ་མེད་པའི་དྲ་བས་ཡོངས་སུ་བརྒྱན་པ་དང་། རིན་པོ་ཆེ་འོད་ཀུན་ཏུ་སྣང་བའི་ཅོད་པན་བཅིངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །འོག་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་མ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ནམ་མཁའ་ལྟ་བུར་ཆགས་པ་མེད་པའི་དཔལ་གྱི་རྒྱལ་མཚན་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་བསྒྲིབས་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་ནོན་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ།
en: Instantly these filled the entire element of space, and together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the northwestern direction emanated kūṭāgāras with the essence of the kings of jewels that illuminated every direction, each having in its center, upon a lion throne, a precious lotus that illuminated the directions, and he and his entourage seated themselves cross-legged upon the lotuses, with their bodhisattva bodies adorned with networks of the invincible light of pearls and with turbans that had the illuminating light of all jewels bound upon their heads.

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་དང་སྒྲ་དང་དབྱངས་དང་ངེས་པའི་ཚིག་མངོན་པར་བསྒྲུབ་པ་རྒྱ་མཚོ་རབ་ཏུ་བརྗོད་པ་དང་། དུས་གསུམ་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་འབྱུང་བའི་ཚུལ་རྒྱ་མཚོའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་རབ་ཏུ་བསྒྲག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པའི་ཚུལ་རྒྱ་མཚོའི་དབྱངས་རབ་ཏུ་བསྒྲག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཚུལ་རྒྱ་མཚོའི་སྤྲིན་གྱི་སྒྲ་རབ་ཏུ་བསྒྲག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཞིང་ཐམས་ཅད་དུ་རྒྱས་པར་འགེངས་པའི་ཚུལ་རྒྱ་མཚོའི་དབྱངས་རབ་ཏུ་བསྒྲག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡང་དག་པར་བསྒྲུབ་པ་དང་། རྣམ་པར་འཕྲུལ་པའི་ཚུལ་རྒྱ་མཚོའི་དབྱངས་རབ་ཏུ་བསྒྲག་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་པ་དང་བདུད་ཀྱི་དཀྲུགས་མ་རྣམ་པར་འཐོར་བ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་རྣམ་པར་འཚང་རྒྱ་བ་དང་། རྣམ་པར་འཕྲུལ་པ་མཛད་པའི་དབྱངས་རྒྱ་མཚོ་རབ་ཏུ་བསྒྲག་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་དང་། མདོ་སྡེའི་ཚུལ་དང་མིང་རྒྱ་མཚོའི་དབྱངས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་བསྒྲགས་པ་དང་། འགྲོ་བ་འདུལ་བ་ཐམས་ཅད་དུས་ལ་བབ་པའི་འཁོར་ལོས་འདུལ་བའི་ཆོས་ཀྱི་ཚུལ་དང་ཐབས་ཀྱི་སྒྲ་རབ་ཏུ་བསྒྲག་པ་དང་། ཡེ་ཤེས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དང་། དགེ་བའི་རྩ་བའི་ཁྱད་པར་དང་དུས་དང་ཐབས་དང་། ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་དབྱངས་རབ་ཏུ་བསྒྲག་པ་བྱེད་ཅིང་། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས།
en: In the downward direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Sarva­tathāgata­prabhā­maṇḍala­vairocanā, the Tathāgata Asaṅga­jñāna­ketu­dhvaja­rāja’s buddha realm, where the bodhisattva Sarvāvaraṇa­vikiraṇa­jñāna­vikrāmin, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and there resounded, from all his pores, an ocean of the languages, sounds, speech, and word definitions of all beings; there resounded the thunder of an ocean of clouds of the descriptions of how all the bodhisattvas in the three times originated; there resounded an ocean of clouds of the descriptions of how all the bodhisattvas in the three times fulfilled their aspirations; there sounded an ocean of clouds of the descriptions of how all bodhisattvas correctly accomplished the perfections; there resounded clouds of oceans of descriptions of how the field of conduct of all bodhisattvas pervaded all realms; there sounded an ocean of clouds of the descriptions of the accomplishments and miracles of all bodhisattvas; there resounded an ocean of descriptions of how all tathāgatas went to the bodhimaṇḍa, dissipated the disturbances of Māra, attained buddhahood at the bodhimaṇḍa, and manifested miracles; there resounded the thunder of an ocean of clouds of the descriptions of the ways and names of the sūtras and how all tathāgatas turned the wheel of the Dharma; there resounded descriptions of the ways and methods of the guiding Dharma that guides all beings through its timely wheel; and there resounded an ocean of descriptions of the aspirations that were made, the particular roots of merit, the time, the methods, and the Dharma, in order to gain the realization of all wisdom.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ། འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། འོག་གི་ཕྱོགས་སུ་བརྟེན་ཏེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཞལ་མེད་ཁང་གཟུགས་བརྙན་རབ་ཏུ་སྣང་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་མཛོད་ཀྱི་ཁང་བ་བརྩེགས་པ་དང་། སེང་གེའི་ཁྲི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་པད་མོའི་སྙིང་པོ་ཡོངས་སུ་བཟུང་བ་དག་མངོན་པར་སྤྲུལ་ནས།
en: He approached the Bhagavat, bowed to the Bhagavat, and in the downward direction emanated kūṭāgāras that were treasures of all the various kinds of shining jewels in the image of the aerial palaces of all the tathāgatas, each having in its center a lotus of every kind of jewel upon a lion throne.

source: རིན་པོ་ཆེའི་སྙིང་པོ་བྱང་ཆུབ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་རབ་ཏུ་སྣང་བའི་རྒྱལ་མཚན་གྱི་ཅོད་པན་མགོ་ལ་བཅིངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས། སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་རིགས་མི་ཟད་པ་ཤིན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཀུན་ཏུ་སྣང་བའི་དབྱངས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྨོན་ལམ་གྱི་གཞི་རབ་ཏུ་རྟོགས་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས། འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དང་། ཚིག་གི་ལམ་ཐམས་ཅད་དང་། གོས་དང་སྨད་གཡོགས་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཐམས་ཅད་དང་། བདག་དང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་དང་།
en: He and his entourage seated themselves cross-legged upon the lotuses, with turbans that were banners shining with the images of all precious bodhimaṇḍas bound upon their heads.

source: སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་དེ་བཞིན་གཤེགས་པ་འདས་པ་ཐམས་ཅད་དང་། ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་དེ་བཞིན་གཤེགས་པ་ལུང་བསྟན་པ་དང་། ལུང་མ་བསྟན་པ་མ་བྱོན་པ་ཐམས་ཅད་དང་། ད་ལྟར་བྱུང་བ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་ན་བཞུགས་པ་རྣམས་ཀྱི་སྔོན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཛད་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་དང་། ལེན་པ་དང་སྦྱིན་པའི་དངོས་པོ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་མཚན་དང་དཔེ་བྱད་བཟང་པོ་དང་།
en: In the upward direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Akṣaya­buddha­vaṃśa­nirdeśā, the Tathāgata Samanta­jñāna­maṇḍala­pratibhāsa­nirghoṣa’s buddha realm, where the bodhisattva Dharma­dhātu­praṇidhi­tala­nirbheda, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and from all his signs and features of a great being, all his pores, his entire body, all his limbs, his fingers and toes, the words he spoke, and his robe and his skirt he revealed, within all his signs and features of a great being, all his pores, his entire body, all his limbs, his fingers and toes, the words he spoke, and his robe and his skirt, the images of an ocean of the past practice of engaging in the perfection of generosity, and all the recipients and the gifts of all of the assemblies of bodhisattvas, of himself, of the Bhagavat Vairocana, of all the tathāgatas throughout the past, of all prophesied and unprophesied tathāgatas throughout the future who have yet to come, and of all who in the present reside in infinite buddha realms in the ten directions.

source: བ་སྤུའི་སྒོ་དང་ལུས་ཐམས་ཅད་དང་། ཡན་ལག་དང་ཉིང་ལག་དང་ཚིག་གི་ལམ་དང་གོས་དང་སྨད་གཡོགས་ཐམས་ཅད་ལ་རབ་ཏུ་སྣང་བར་གྱུར་པར་རྣམ་པར་བསྟན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་སྣང་བར་ཡོངས་སུ་བསྟན་པ་དང་།
en: He made visible the images of an ocean of the entire past practice of engaging in the perfection of correct conduct.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པར་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་འཐུབ་པ་རབ་ཏུ་བསྟན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་བ་ཡོངས་སུ་བསྟན་པ་དང་།
en: He made visible the images of an ocean of the past practice of engaging in the perfection of patience through his limbs, his fingers, and his toes being cut off.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བརྩོན་འགྲུས་དང་དྲག་ཤུལ་དང་། རྣམ་པར་གནོན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་།
en: He made visible the images of an ocean of the past practice of the diligence, vehemence, and prowess of all bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བསམ་གཏན་རྒྱ་མཚོ་ཡོངས་སུ་ཚོལ་ཞིང་རབ་ཏུ་བསྒྲུབ་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཚུལ་ཡོངས་སུ་བསྒྲུབ་ཅིང་།
en: He made visible the images of an ocean of the past practice of seeking the dhyāna of all the tathāgatas.

source: ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་ལྡན་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་ཞིང་ཤིན་ཏུ་ཞེ་ནོན་པའི་ལུས་དང་ངོའི་གཟུགས་བརྙན་རྣམ་པར་དམྱིགས་པར་བྱ་བས་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་།
en: He revealed the images of an ocean of the past practices of engaging in perfecting the way of the Dharma wheel of all the tathāgatas, and he revealed the bodies and faces of those seeking the Dharma with great resolve giving away all possessions.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་ཞིང་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ལམ་ལ་འགྲོ་བ་ཐམས་ཅད་མངོན་པར་མོས་པར་བྱེད་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་།
en: He revealed the appearances of an ocean of the past practices of rejoicing in seeing all the tathāgatas, the path of all bodhisattvas, and bringing illumination to all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་མངོན་པར་བསྒྲུབ་པའི་སྒོ་ཡོངས་སུ་དག་པའི་རྒྱན་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་།
en: He revealed the appearances of an ocean of the past practices of the fulfillment of an ocean of prayers by all bodhisattvas through which there is a display of perfect purification.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་ཏུ་གྲུབ་པ་དང་། རྣམ་པར་མནན་པ་དང་། རྣམ་པར་དག་པར་བྱས་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་།
en: He revealed the appearances of an ocean of the past practice of engaging in the accomplishment, prowess, and purification of the perfection of strength of all bodhisattvas.

source: ཆོས་ཀྱི་དབྱིངས་རྒྱ་ཆེན་པོ་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱིས་རྒྱས་པར་བཀང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་བྱེད་ཅིང་། མྱི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས།
en: Filling the vast expanse of the realm of phenomena with clouds of all miraculous manifestation, he revealed the appearances of an ocean of the past practice endowed with the domain of the wisdom of all bodhisattvas.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ། འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། སྟེང་གི་ཕྱོགས་སུ་བརྟེན་ཏེ། རྡོ་རྗེའི་དབང་པོ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་སྙིང་པོ་ཅན་གྱི་ཁང་པ་བརྩེགས་པ་དང་། སེང་གེའི་ཁྲི་རྡོ་རྗེ་དང་།
en: He approached the Bhagavat, bowed to the Bhagavat, and in the upward direction emanated kūṭāgāras that were adorned by all kinds of lords of vajras, each having in its center a lotus of sapphires upon a lion throne.

source: ཨིན་དྲ་ནཱི་ལའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས་ནོར་བུའི་རྒྱལ་པོ་རིན་པོ་ཆེ་ཐམས་ཅད་རབ་ཏུ་འབར་བའི་དྲ་བས་ཀུན་ནས་བརྒྱན་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པའི་མཚན་དབྱངས་སུ་སྒྲོག་པའི་ཕྲེང་བ་རབ་ཏུ་འཕྱང་བ་དང་། མགོ་ལ་རིན་པོ་ཆེའི་ཅོད་པན་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་ཉི་ཤུ་ལྔ་པ།
en: He and his entourage, their blessed bodies adorned by a network of all shining precious kings of jewels and hung with necklaces of the kings of jewels from which sounded the names of the tathāgatas of the three times, and their heads bound by precious turbans, seated themselves cross-legged upon the lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་འཁོར་དང་བཅས་པར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་གྱིས་བྱུང་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ནས་ཞལ་དུ་ལྟ་བ།
en: All those bodhisattvas and their entourages had become so through the completely good conduct and prayer of bodhisattvas. They had been at the feet of all tathāgatas and gazed upon their faces.

source: ཡེ་ཤེས་ཡོངས་སུ་དག་པའི་མྱིག་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དང་། མདོ་སྡེའི་ཚུལ་གྱི་གསུང་རྒྱ་མཚོ་ལ་རྣ་བ་ཡོངས་སུ་གཞོལ་བ།
en: They possessed the completely pure eyes of wisdom. The ocean of the teaching of the way of the sūtras and the wheel of the Dharma of all the tathāgatas had entered their ears.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབང་རབ་ཏུ་ཐོབ་པར་བྱ་བ་ལ། དམ་པའི་ཕ་རོལ་ཏུ་བགྲོད་པར་ཕྱིན་པའི་མཆོག་ཐོབ་པ།
en: They had perfectly perfected the perfections that bring the attainment of the power of all bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་འདོང་བ། སྐད་ཅིག་སྐད་ཅིག་ཏུ། ཡོངས་སུ་བསྟན་པར་རྣམ་པར་འཕྲུལ་བས་བྱུང་བ།
en: In each instant they manifested the miracle of going into the presence of all tathāgatas.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ལུས་གཅིག་གིས་རྒྱས་པར་དགང་བའི་ཡུལ་དང་ལྡན་པ།
en: They had the range of pervading all worlds with a single body.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ལུས་མངོན་པར་འབྱུང་ཞིང་རྣམ་པར་སྣང་བ།
en: They manifested the appearance of their bodies being present in the assemblies of the pupils of all tathāgatas.

source: རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཁམས་གཅིག་ཏུ་སྣང་ཞིང་ཁོངས་སུ་ཆུད་པར་ཡང་དག་པར་སྟོན་པའི་ཡུལ་དང་ལྡན་པ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་།
en: They had the range of activity of manifesting all worlds being included within one world that is within a single atom.

source: འདུལ་བའི་དུས་ལ་སྡོང་བར་གཞོལ་བ།
en: They ripened all beings, being present at the exact time for guiding them.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་རབ་ཏུ་སྒྲོག་པའི་ཡུལ་དང་ལྡན་པ།
en: They had the range of activity of emitting from all their pores the thunder of the clouds of the Dharma wheel of all the tathāgatas.

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་ཡོངས་སུ་ཤེས་པ་རབ་ཏུ་ཐོབ་པ།
en: They had attained the knowledge that all the realms of beings were like magical tricks.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མིག་ཡོར་ལྟ་བུར་ཁོང་དུ་ཆུད་པ།
en: They had realized that all the tathāgatas are like illusions.

source: སྲིད་པའི་རྒྱུད་དུ་སྐྱེ་བ་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་ཤེས་པར་བྱུང་བ་ལས་དང་རྣམ་པར་སྨིན་པ་ཐམས་ཅད་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་པས་རྣམ་པར་དག་པ།
en: They were purified by the knowledge that all rebirths within the continuation of existence were like dreams.

source: ཡེ་ཤེས་མངོན་པར་གྲུབ་པ་ཐམས་ཅད་སྨིག་རྒྱུ་ལྟ་བུར་མངོན་པར་ཤེས་པ།
en: They knew that all accomplishments of wisdom are like mirages.

source: འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་ཁོང་དུ་ཆུད་པ་དང་།
en: They had realized that all infinite worlds are like illusory manifestations.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: They had attained the ten strengths of the tathāgatas and the light of wisdom.

source: མྱི་འཇིགས་པའི་ཁྱུ་མཆོག་དང་། སེང་གེའི་ང་རོས་རྣམ་པར་གནོན་པ།
en: They were supreme beings of fearlessness and had the forcefulness of the lion’s roar.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་མྱི་ཟད་པའི་རྒྱ་མཚོར་ཞུགས་པ།
en: They had entered the inexhaustible ocean of unique knowledge.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་རྒྱ་མཚོ་དང་། ཆོས་ཀྱི་ངེས་པའི་ཚིག་གི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ།
en: They had obtained the ocean of the languages of beings and the wisdom of the meaning of the words of the Dharma.

source: ཆོས་ཀྱི་དབྱིངས་དང་ནམ་མཁའ་ལྟར་ཆགས་པ་མྱེད་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་ལྡན་པ།
en: They possessed an unimpeded scope of wisdom that was as vast as the realm of phenomena and space.

source: ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ།
en: They possessed the pure domain of the wisdom of the clairvoyances of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མངོན་པར་ཤེས་པ་ལ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་དཀྲུག་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ།
en: They possessed the diligence that disrupts the domain of all the māras.

source: དུས་གསུམ་ཐམས་ཅད་ཤེས་པའི་སྟོབས་ལ་རབ་ཏུ་གནས་པ།
en: They were established in the power of knowing the three times.

source: ཆོས་ཐམས་ཅད་ལ་ཡེ་ཤེས་སྒྲིབ་པ་མེད་པ་རབ་ཏུ་ཐོབ་པ།
en: They had attained the unobscured wisdom of all phenomena.

source: གནས་མྱེད་པས་ནམ་མཁའི་སྤྱོད་ཡུལ་དང་ལྡན་པ།
en: They had the field of activity of space without any base.

source: ཐམས་ཅད་མཁྱེན་པའི་ས་ལེན་པ་མྱེད་པ།
en: They had everlasting omniscience.

source: ནམ་མཁའ་ལྟ་བུའི་བརྩོན་འགྲུས་དང་ལྡན་པ།
en: They had diligence as vast as space.

source: སྲིད་པ་ཐམས་ཅད་མྱི་དམྱིགས་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་ཅན།
en: They had the range of wisdom that did not focus on all existences as its object.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་རབ་ཏུ་ཞུགས་པ།
en: They had the pervading wisdom of the ocean of processes of the entire realm of phenomena.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཐ་མྱི་དད་པའི་ཡེ་ཤེས་ཀྱི་སྒོར་ཞུགས་པ།
en: They had entered through the gateway of the nondifferentiating wisdom of all world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་གཅིག་ནས་གཅིག་ཏུ་གཟུང་བའི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ།
en: They demonstrated the miracle of all the worlds being connected, one with the other.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཐམས་ཅད་དུ་སྐྱེས་པའི་ལུས་ཡོངས་སུ་སྟོན་པ།
en: They demonstrated bodies that were born in all kinds of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དབྱིབས་ཕྲ་བ་དང་། རྒྱ་ཆེ་བ་དང་ཡངས་པ་དང་།
en: They had the knowledge of the small and vast, wide and narrow shapes of all world realms.

source: དོག་པ་སྣ་ཚོགས་རབ་ཏུ་རྟོགས་པ་ཤིན་ཏུ་ཕྲ་ཞིང་རྒྱ་ཆེན་པོ་ཡང་དག་པར་གཟུད་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ།
en: They had realized the wisdom of the small being the vast.

source: དམྱིགས་པ་རྒྱ་ཆེན་པོ་ཤིན་ཏུ་ཕྲ་བར་ཤེས་པ་དང་ལྡན་པ།
en: They had the knowledge of the vast being the small.

source: སངས་རྒྱས་ཐམས་ཅད་དང་སེམས་ཀྱི་སྐད་ཅིག་ལ་འགྲོགས་པ་རབ་ཏུ་ཐོབ་པ།
en: They had attained being in the presence of all buddhas in a single instant of mind.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཀྱི་ལུས་དང་ལྡན་པ།
en: They possessed bodies that had been blessed by all the tathāgatas.

source: ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་མགོ་རྨོངས་པ་མྱེད་པའི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ་སེམས་ཀྱི་སྐད་ཅིག་གིས་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་རྣམ་པར་འཕྲུལ་པས་རྒྱས་པར་འགེངས་པ་ཤ་སྟག་སྟེ།
en: They had attained the ignorance-free wisdom in all the oceans of the directions. They pervaded all the oceans of the directions with emanations in an instant of mind.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་ལྟ་བུའི་ཡོན་ཏན་ཚད་མྱེད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་གིས་ཛེ་ཏའི་ཚལ་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པར་གྱུར་ཀྱང་།
en: These bodhisattvas who all had such limitless qualities through the blessings of the tathāgatas filled the entirety of Jetavana.
